## 1. IMPORT LIBRARIES

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

## 2. CSV's

In [3]:
assessments = pd.read_csv('Data/assessments.csv')
courses = pd.read_csv('Data/courses.csv')
studentassess = pd.read_csv('Data/studentAssessment.csv')
stinfo = pd.read_csv('Data/studentInfo.csv')
studentreg = pd.read_csv('Data/studentRegistration.csv')
studentvle = pd.read_csv('Data/studentVle.csv')
vle = pd.read_csv('Data/vle.csv')

#### 2.1 Check each of the files to see which ones contain information of interest.

In [4]:
# Defining a function which will display 2 first and 2 last rows and variables information.

def displayinfo(x):
    print('\033[1m' + 'HEAD' + '\033[0m')
    display(x.head(2))
    print('\033[1m' + 'TAIL' + '\033[0m')
    display(x.tail(2))
    print('\033[1m' + 'INFO' + '\033[0m')
    display(x.info())

In [5]:
### ASSESSMENTS ###

displayinfo(assessments)

HEAD

  code_module code_presentation  id_assessment assessment_type date  weight
0         AAA             2013J           1752             TMA   19    10.0
1         AAA             2013J           1753             TMA   54    20.0

TAIL

    code_module code_presentation  id_assessment assessment_type date  weight
204         GGG             2014J          37437             TMA  173     0.0
205         GGG             2014J          37444            Exam  229   100.0

INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206 entries, 0 to 205
Data columns (total 6 columns):
code_module          206 non-null object
code_presentation    206 non-null object
id_assessment        206 non-null int64
assessment_type      206 non-null object
date                 206 non-null object
weight               206 non-null float64
dtypes: float64(1), int64(1), object(4)
memory usage: 9.7+ KB

None

In [6]:
### COURSES ###

displayinfo(courses)

HEAD

  code_module code_presentation  module_presentation_length
0         AAA             2013J                         268
1         AAA             2014J                         269

TAIL

   code_module code_presentation  module_presentation_length
20         GGG             2014J                         269
21         GGG             2014B                         241

INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 3 columns):
code_module                   22 non-null object
code_presentation             22 non-null object
module_presentation_length    22 non-null int64
dtypes: int64(1), object(2)
memory usage: 608.0+ bytes

None

In [7]:
### STUDENT ASSESSMENT ###

displayinfo(studentassess)

HEAD

   id_assessment  id_student  date_submitted  is_banked score
0           1752       11391              18          0    78
1           1752       28400              22          0    70

TAIL

        id_assessment  id_student  date_submitted  is_banked score
173910          37443      546724             230          0   100
173911          37443      558486             224          0    80

INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173912 entries, 0 to 173911
Data columns (total 5 columns):
id_assessment     173912 non-null int64
id_student        173912 non-null int64
date_submitted    173912 non-null int64
is_banked         173912 non-null int64
score             173912 non-null object
dtypes: int64(4), object(1)
memory usage: 6.6+ MB

None

In [8]:
studentassess.is_banked.value_counts()

0    172003
1      1909
Name: is_banked, dtype: int64

In [9]:
### STUDENT INFORMATION ###

displayinfo(stinfo)

HEAD

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass

TAIL

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
32591,GGG,2014J,2679821,F,South East Region,Lower Than A Level,90-100%,35-55,0,30,N,Withdrawn
32592,GGG,2014J,2684003,F,Yorkshire Region,HE Qualification,50-60%,35-55,0,30,N,Distinction

INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 12 columns):
code_module             32593 non-null object
code_presentation       32593 non-null object
id_student              32593 non-null int64
gender                  32593 non-null object
region                  32593 non-null object
highest_education       32593 non-null object
imd_band                32593 non-null object
age_band                32593 non-null object
num_of_prev_attempts    32593 non-null int64
studied_credits         32593 non-null int64
disability              32593 non-null object
final_result            32593 non-null object
dtypes: int64(3), object(9)
memory usage: 3.0+ MB

None

In [10]:
### STUDENT REGISTRATION ###

displayinfo(studentreg)

HEAD

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159,?
1,AAA,2013J,28400,-53,?

TAIL

,code_module,code_presentation,id_student,date_registration,date_unregistration
32591,GGG,2014J,2679821,-49,101
32592,GGG,2014J,2684003,-28,?

INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32593 entries, 0 to 32592
Data columns (total 5 columns):
code_module            32593 non-null object
code_presentation      32593 non-null object
id_student             32593 non-null int64
date_registration      32593 non-null object
date_unregistration    32593 non-null object
dtypes: int64(1), object(4)
memory usage: 1.2+ MB

None

In [25]:
### STUDENT VLE ###

displayinfo(studentvle)

HEAD

  code_module code_presentation  id_student  id_site  date  sum_click
0         AAA             2013J       28400   546652   -10          4
1         AAA             2013J       28400   546652   -10          1

TAIL

         code_module code_presentation  id_student  id_site  date  sum_click
10655278         GGG             2014J      654064   896939   269          1
10655279         GGG             2014J      654064   896939   269          1

INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10655280 entries, 0 to 10655279
Data columns (total 6 columns):
code_module          object
code_presentation    object
id_student           int64
id_site              int64
date                 int64
sum_click            int64
dtypes: int64(4), object(2)
memory usage: 487.8+ MB

None

In [11]:
### VLE ###

displayinfo(vle)

HEAD

   id_site code_module code_presentation activity_type week_from week_to
0   546943         AAA             2013J      resource         ?       ?
1   546712         AAA             2013J     oucontent         ?       ?

TAIL

      id_site code_module code_presentation activity_type week_from week_to
6362   897060         GGG             2014J      resource         ?       ?
6363   897100         GGG             2014J      resource         ?       ?

INFO
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6364 entries, 0 to 6363
Data columns (total 6 columns):
id_site              6364 non-null int64
code_module          6364 non-null object
code_presentation    6364 non-null object
activity_type        6364 non-null object
week_from            6364 non-null object
week_to              6364 non-null object
dtypes: int64(1), object(5)
memory usage: 298.4+ KB

None

### After checking all the tables, we decide which columns we'll be using to build our final data.

#### - code_module
#### - code_presentation
#### - id_student
#### - gender
#### - region
#### - highest_education
#### - imd_band
#### - age_band
#### - num_of_prev_attempts
#### - studied_credits
#### - disability
#### - final_result
#### - module_presentation_length

## We join the courses and stinfo dataframes.

In [12]:
merged = pd.merge(left=stinfo, right=courses, left_on=['code_module', 'code_presentation'],
                  right_on=['code_module', 'code_presentation'])

merged.head()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,module_presentation_length
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,268
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass,268
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn,268
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass,268
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass,268

## We also join merged and student assessment.

In [13]:
merged2 = pd.merge(left=studentassess, right=merged, left_on=['id_student'], right_on=['id_student'])
merged2.head()

,id_assessment,id_student,date_submitted,is_banked,score,code_module,code_presentation,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,module_presentation_length
0,1752,11391,18,0,78,AAA,2013J,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,268
1,1753,11391,53,0,85,AAA,2013J,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,268
2,1754,11391,115,0,80,AAA,2013J,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,268
3,1755,11391,164,0,85,AAA,2013J,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,268
4,1756,11391,212,0,82,AAA,2013J,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,268

## Now we drop the duplicate rows

In [14]:
merged2 = merged2.drop_duplicates()

In [15]:
merged2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207319 entries, 0 to 207318
Data columns (total 17 columns):
id_assessment                 207319 non-null int64
id_student                    207319 non-null int64
date_submitted                207319 non-null int64
is_banked                     207319 non-null int64
score                         207319 non-null object
code_module                   207319 non-null object
code_presentation             207319 non-null object
gender                        207319 non-null object
region                        207319 non-null object
highest_education             207319 non-null object
imd_band                      207319 non-null object
age_band                      207319 non-null object
num_of_prev_attempts          207319 non-null int64
studied_credits               207319 non-null int64
disability                    207319 non-null object
final_result                  207319 non-null object
module_presentation_length    207319 non-null int64
dtypes: int64(7), object(10)
memory usage: 28.5+ MB

## Let's export our final file

In [35]:
merged2.to_csv('Data/final.csv', index=False)